Tekla.Structures.Model.RebarCrankingNullable.EndCrankingTypeEnum
The end cranking type.

Tekla.Structures.Model.RebarCrankingNullable.EndCrankingTypeEnum.NO_CRANKING
No cranking.

Tekla.Structures.Model.RebarCrankingNullable.EndCrankingTypeEnum.CUSTOM_CRANKING
Custom cranking.

Tekla.Structures.Model.RebarCrankingNullable.EndCrankingTypeEnum.STANDARD_CRANKING
Standard cranking.